/*Написать программу, которая из имеющегося массива строк формирует 
массив из строк, длина которых меньше либо равна 3 символа. 
Первоначальный массив можно ввести с клавиатуры, либо задать 
на старте выполнения алгоритма. 
Примеры:
["hello", "2", "world", ":-)"] -> ["2", ":-)"]
["1234", "1567", "-2", "computer science"] -> ["-2"]
["Russia", "Denmark", "Kazan"] -> []
*/


string[] array1 = new string[] {"123", "ура", "world", "го", "hello", ".,:"};
Console.WriteLine(); 

for (int i = 0; i < array1.Length; i++) 
 {
    if (array1[i].Length <= 3) 
    Console.Write($"{array1[i]}" + "\t");  
 }
 

